package special_Class._11_18;

public class _01_Problem {
    public static void main(String[] args) {
        // 요구 사항

        // 문자 3개 선택하기 위한 상수 생성

        // 연산자 char 배열 생성 - { '+' , '-' , '*' }

        // 게임 판수 변수 생성

        // 점수 저장 변수 생성

        while (true) {

        // 각 라운드 시작 시 게임 라운드 번호 표시

        // 사용자 아무 값이나 입력시 시작 - Input

        // 생성된 랜덤 연산자 저장 배열 생성

        // 랜덤 연산자 생성 - Math.random()

        // 랜덤 생성 연산자가 연속되는 지 확인하는 알고리즘 작성

        // 중복된 연산자가 2개일 경우


        // 알고리즘 작성칸 --------------

        // rt74444444444444

        // 중복된 연산자가 3개일 경우


        // 알고리즘 작성칸 --------------


        // 현재 점수 출력

        // 점수가 5점 이상 , 점수가 -5 이하 일 경우 판별

        // 만약 ( 점수 >= 5 ) 일경우 승리 출력

        // 만약 ( 점수 <= -5 ) 일경우 패배 출력


        // 콤보 점수 계산
        }
    }
}
